Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The layer depth is defined as being higher when "further away" from the camera and lower when "closer" to the camera, so if you have three layers with depths -100, 0, 100, the layers will draw in the order 100, 0, -100, so that the "top" layer (i.e., the closest to the camera view and so drawn over everything else) will be the layer with the -100 depth.
zh_cn: 层深度被定义为当"远离"相机时较高，当"靠近"相机时较低，因此如果有深度为-100、0、100的三个层，则这些层将按照100、0、-100的顺序绘制，因此"顶部"层(即，最靠近相机视图，因此绘制在所有其他层之上)将是深度为-100的层。

source: The layer name to assign the created instance to (default is "Instances")
zh_cn: 将创建的实例指定给的层名称(默认为"实例")

source: The left cell column of the region.
zh_cn: 区域的左侧单元格列。

source: The left edge of the rectangle to check
zh_cn: 要检查的矩形的左边缘

source: The left edge slice
zh_cn: 切片左边边缘

source: The left mouse button
zh_cn: 鼠标左键

source: The left position in the surface of the part to be drawn.
zh_cn: 待绘制的部分表面的左侧位置。

source: The left position of the region of cells to copy from the source grid.
zh_cn: 要从源网格复制的单元格区域的左侧位置。

source: The left side of the bounding box
zh_cn: 边界框的左侧

source: The left stick pressed (as a button)
zh_cn: 按下左侧操纵杆(作为按钮)

source: The length (number of array indices) to copy.
zh_cn: 要复制的长度(数组索引的数量)。

source: The length away of the point to return.
zh_cn: 要返回的点的长度。

source: The length for the change in gain in milliseconds.
zh_cn: 增益变化的长度，以毫秒为单位。

source: The length of the arrow in pixels.
zh_cn: 箭头的长度，以像素为单位。

source: The length of the buffer (the number of bytes of audio data, excluding the header).
zh_cn: 缓冲区的长度(音频数据的字节数，不包括头)。

source: The length of the buffer (the number of the bytes in the buffer).
zh_cn: 缓冲区的长度(缓冲区中的字节数)。

source: The length of the change in gain in milliseconds.
zh_cn: 增益变化的长度，以毫秒为单位。

source: The length of the part of the buffer to load (in bytes).
zh_cn: 要加载的缓冲区部分的长度(以字节为单位)。

source: The length of the sequence in frames.
zh_cn: 帧中序列的长度。

source: The level of anti-aliasing filtering (0, 2, 4 or 8).
zh_cn: 抗锯齿过滤的级别(0、2、4或8)。

source: The light is a directional light
zh_cn: 灯光是平行光

source: The light is a point light
zh_cn: 灯光是点光源

source: The light range (in pixels)
zh_cn: 光线范围(以像素为单位)

source: The lights can also be given a colour, which will also affect the perceived intensity of the light as certain colours appear "darker" than others.
zh_cn: 灯光也可以被赋予一种颜色，这也会影响光的感知强度，因为某些颜色看起来比其他颜色"更深"。

source: The likely use case for these functions is for repeating a texture in 3D but in order for it to work and not pull images from the rest of the texture page, the sprite used will need to be marked as being on a "Separate Texture Page" in the Sprite Editor.
zh_cn: 这些函数的可能用例是在3D中重复纹理，但是为了使它工作而不是从纹理页面的其余部分拉图像，所使用的精灵需要在精灵编辑器中被标记为在"单独的纹理页面"上。

source: The linear damping to be applied to the particle fixture.
zh_cn: 应用于粒子夹具的线性阻尼。

source: The listener number to get the data for.
zh_cn: 要获取其数据的侦听器编号。

source: The listener to get the data for (default 0).
zh_cn: 要获取数据的侦听器(默认值为0)。

source: The listener to set the orientation of.
zh_cn: 要设置的方向。

source: The local storage path to save the file to
zh_cn: 要将文件保存到的本地存储路径

source: The local x coordinate of the new center of mass.
zh_cn: 新质心的局部x坐标。

source: The local x coordinate where joint 1 is anchored to the first instance
zh_cn: 关节1锚定在第一个实例上的局部x坐标

source: The local x coordinate where joint 2 is anchored to the second instance
zh_cn: 关节2锚定到第二个实例的局部x坐标

source: The local y coordinate of the new center of mass.
zh_cn: 新质心的局部y坐标。

source: The local y coordinate where joint 1 is anchored to the first instance
zh_cn: 关节1锚定在第一个实例上的局部y坐标

source: The local y coordinate where joint 2 is anchored to the second instance
zh_cn: 关节2锚定到第二个实例的局部y坐标

source: The log base.
zh_cn: log基数。

source: The look at direction and up direction are based on the vectors that are resolved from the given relative x, y and z positions, and default to (0, 0, 1000) for the look at direction and (0, 1, 0) for the up direction, as shown in the illustration below:
zh_cn: 观察方向和向上方向是基于给定的相对x, y和z位置解析的向量，对于观察方向默认为(0,0,1000)，对于向上方向默认为(0,1,0)，如图所示:

source: The low end of the range from which the random number will be selected.
zh_cn: 将从中选择随机数的范围的下限。

source: The lower angle limit for the joint in degrees.
zh_cn: 关节的角度下限，以度为单位。

source: The lower permitted limit for the joint angle
zh_cn: 关节角度允许的下限

source: The lower permitted limit for the joint movement
zh_cn: 关节运动允许的下限

source: The main audio bus
zh_cn: 主音频总线

source: The map string to use (see the description for more information).
zh_cn: 要使用的映射字符串(有关更多信息，请参阅描述)。

source: The mapped elements will be padded to offset and order by the traversing direction.
zh_cn: 映射的元素将按遍历方向填充偏移和排序。

source: The mapped elements will keep their original position on the array.
zh_cn: 映射的元素将保持它们在数组中的原始位置。

source: The mask can contain a path and can contain wildchars, for example 'C:\temp\*.doc'.
zh_cn: 掩码可以包含路径，也可以包含通配符，例如'C:\temp\*.doc'。

source: The mask to compare the particles flags with.
zh_cn: 要与粒子标志进行比较的遮罩。

source: The mask to use for searching.
zh_cn: 用于搜索的掩码。

source: The mask value
zh_cn: 掩码值

source: The mask value is defined in the same way as you would define the flags when creating the particle (see the function physics_particle_create() for an example), ie: using the bitwise or "|" to mask off the appropriate bits for each flag.
zh_cn: 遮罩值的定义方式与创建粒子时定义标志的方式相同(参见函数physics_particle_create()的示例)，即:使用按位or"|"来遮罩每个标志的适当位。

source: The mask value is defined in the same way as you would define the flags when creating the particles (see the functions physics_particle_create() for an example), ie: using the bitwise or "|" to mask off the appropriate bits for each flag.
zh_cn: 掩码值的定义方式与创建粒子时定义标志的方式相同(参见函数physics_particle_create()的示例)，即:使用位或"|"屏蔽每个标志的适当位。

source: The mask value to use
zh_cn: 要使用的掩码值

source: The matrix data as an array
zh_cn: 矩阵数据作为数组

source: The matrix index to use.
zh_cn: 使用的矩阵索引。

source: The matrix itself is created as 16 value array where the first 4 elements are row 1, the second 4 elements are row 2 etc... of a 4x4 matrix.
zh_cn: 矩阵本身被创建为16值数组，其中前4个元素是第1行，后4个元素是第2行，依此类推...一个4x4的矩阵。

source: The matrix to use
zh_cn: 要使用的矩阵

source: The maximum anisotropic level to use (default: 16).
zh_cn: 要使用的最大各向异性级别(默认值:16)。

source: The maximum bottom position of the bounding box.
zh_cn: 边界框的最大底部位置。

source: The maximum depth of the callstack
zh_cn: 调用堆栈的最大深度

source: The maximum direction the particle can start at.
zh_cn: 粒子可以开始的最大方向。

source: The maximum distance in the x direction the instance will move.
zh_cn: 实例将在x方向上移动的最大距离。

source: The maximum distance in the y direction the instance will move.
zh_cn: 实例将在y方向上移动的最大距离。

source: The maximum distance the object can travel (-1 or 0 a default value of 1000 pixels).
zh_cn: 对象可以移动的最大距离(-1或0，默认值为1000像素)。

source: The maximum extension for the connection between the two anchor points.
zh_cn: 两个锚点之间连接的最大延伸。

source: The maximum falloff distance relative to the listener.
zh_cn: 相对于侦听器的最大衰减距离。

source: The maximum force value for the joint.
zh_cn: 关节的最大力值。

source: The maximum frictional force that will be applied
zh_cn: 将施加的最大摩擦力

source: The maximum gain (default 1).
zh_cn: 最大增益(默认为1)。

source: The maximum height in pixels for the game window.
zh_cn: 游戏窗口的最大像素高度。

source: The maximum horizontal speed the view can move at (set to -1 for "instant" following, default is -1).
zh_cn: 视图可以移动的最大水平速度(设置为-1表示"即时"跟随，默认为-1)。

source: The maximum index value to get the leaderboard data from.
zh_cn: 获取排行榜数据的最大索引值。

source: The maximum left position of the bounding box.
zh_cn: 边界框的最大左侧位置。

source: The maximum length that the joint can "stretch"
zh_cn: 关节能"拉伸"的最大长度

source: The maximum level for anisotropic filtering (default: 16)
zh_cn: 各向异性过滤的最高级别(默认值:16)

source: The maximum lifespan of the particles.
zh_cn: 重力的方向。

source: The maximum mipmap level (default: 16)
zh_cn: 最大mipmap贴图级别(默认值:16)

source: The maximum mipmap level value to use (default: 16)
zh_cn: 要使用的最大mipmap贴图级别值(默认值:16)

source: The maximum number of cached copies of the font that can be stored.
zh_cn: 可存储的字体的缓存副本的最大数量。

source: The maximum number of cached copies of the sprite that can be stored.
zh_cn: 可存储的精灵的缓存副本的最大数量。

source: The maximum number of clients that can connect at once.
zh_cn: 一次可以连接的最大客户端数量。

source: The maximum number of particles to permit.
zh_cn: 允许的最大粒子数。

source: The maximum number of splits that are allowed.
zh_cn: 允许的最大分割数。

source: The maximum right position of the bounding box.
zh_cn: 边界框的最大右位置。

source: The maximum rotational force that will be applied
zh_cn: 将施加的最大旋转力

source: The maximum size the particle can start at.
zh_cn: 粒子开始的最大尺寸。

source: The maximum speed the particle can start at.
zh_cn: 粒子可以开始的最大速度。

source: The maximum starting angle of the particles.
zh_cn: 粒子的最大起始角度。

source: The maximum the final colour's blue component can be.
zh_cn: 最终颜色的蓝色成分的最大值。

source: The maximum the final colour's green component can be.
zh_cn: 最终颜色的绿色成分的最大值。

source: The maximum the final colour's hue component can be.
zh_cn: 最终颜色的色调分量可以达到的最大值。

source: The maximum the final colour's red component can be.
zh_cn: 最终颜色的红色成分的最大值。

source: The maximum the final colour's saturation component can be.
zh_cn: 最终颜色的饱和度分量可以达到的最大值。

source: The maximum the final colour's value component can be.
zh_cn: 最终颜色的亮度分量可以达到的最大值。

source: The maximum top position of the bounding box.
zh_cn: 边界框的最大顶部位置。

source: The maximum torque value for the joint.
zh_cn: 关节的最大扭矩值。

source: The maximum value to clamp between.
zh_cn: 夹紧之间的最大值。

source: The maximum vertical speed the view can move at (set to -1 for "instant" following, default is -1).
zh_cn: 视图可以移动的最大垂直速度(设置为-1表示"即时"跟随，默认为-1)。

source: The maximum width (in pixels) of the string before a line break as if the string was bring drawn.
zh_cn: 在换行之前字符串的最大宽度(以像素为单位),就好像字符串是用画线绘制的一样。

source: The maximum width in pixels for the game window.
zh_cn: 游戏窗口的最大像素宽度。

source: The maximum width in pixels of the string before a line break.
zh_cn: 换行符前字符串的最大宽度(以像素为单位)。

source: The message to attach to the challenge.
zh_cn: 附加在挑战上的信息。

source: The message to show in the dialog.
zh_cn: 要在对话框中显示的消息。

source: The message to show to the user.
zh_cn: 要显示给用户的消息。

source: The method (user-defined function) to use as the exception handler, or undefined to reset it to default.
zh_cn: 用作异常处理程序的方法(用户定义的函数)，或未定义以将其重置为默认值。

source: The method can be one of the constants listed below.
zh_cn: 该方法可以是下列常量之一。

source: The method can be one of the following constants:
zh_cn: 该方法可以是下列常量之一:

source: The method variable to check
zh_cn: 要检查的方法变量

source: The method variable to check.
zh_cn: 要检查的方法变量。

source: The middle mouse button (this may not be valid for all target platforms)
zh_cn: 鼠标中键(这可能不适用于所有目标平台)

source: The milliseconds in which a transfer from a server will timeout.
zh_cn: 来自服务器的传输超时的毫秒数。

source: The milliseconds in which a transfer to a server will timeout.
zh_cn: 到服务器的传输将超时的毫秒数。

source: The minimum and maximum direction values default at 0, which means that the particle will move to the right with no variation, but these values can be changed to limit the direction of movement following the standard GameMaker directions of 0 being right, 90 being up, 180 being left and 270 being down.
zh_cn: 最小和最大方向值默认为0，这意味着粒子将向右移动，没有任何变化，但这些值可以更改，以限制移动方向，遵循标准的GameMaker方向:0为右，90为上，180为左，270为下。

source: The minimum and maximum orientation values default at 0 but these values can be changed to randomise the orientation following the standard GameMaker directions of 0 degrees being right, 90 degrees being up, 180 degrees being left and 270 degrees being down.
zh_cn: 与其他粒子函数一样，您可以提供一个最小值和一个最大值(以步为单位),每个粒子的寿命将是指定范围内的随机步数。

source: The minimum and maximum size values default at 1 (meaning that the size is the same ratio as the base particle after the part_type_scale() scale has been set) and if they are set to the same value, the initial size for all particles will be the same, but if set to different values, each particle will start with a random size from within the range, for example if you have a minimum of 0.5 and a maximum of 2, all particles will be created with a size between half and double the base scale.
zh_cn: 最小和最大尺寸值默认为 1（意味着在设置 part_type_scale() 比例后，尺寸与基本粒子的比例相同），如果它们设置为相同的值，所有粒子的初始尺寸将为 相同，但如果设置为不同的值，每个粒子将以范围内的随机大小开始，例如，如果您的最小值为 0.5，最大值为 2，则创建的所有粒子的大小将介于基本比例的一半和两倍之间。

source: The minimum and maximum speed values default at 1, which means that the particle will move 1 pixel each step, and if they are set to the same value, the initial speed for all particles will be the same, but if set to different values, each particle will start with a random speed from within the given range.
zh_cn: 最小和最大速度值默认为1，这意味着粒子将每步移动1个像素，如果它们设置为相同的值，所有粒子的初始速度将相同，但如果设置为不同的值，每个粒子将以给定范围内的随机速度开始。

source: The minimum direction the particle can start at.
zh_cn: 粒子可以开始的最小方向。

source: The minimum height in pixels for the game window.
zh_cn: 游戏窗口的最小高度，以像素为单位。

source: The minimum horizontal space between the edge of the view area and the instance it is set to follow (before the view begins moving and if it is set to follow an instance, default is 0).
zh_cn: 视图区域的边缘和它被设置为跟随的实例之间的最小水平间距(在视图开始移动之前，如果它被设置为跟随实例，默认值为0)。

source: The minimum lifespan of the particles.
zh_cn: 重力的强度。

source: The minimum mipmap level to use
zh_cn: 要使用的最低mipmap级别

source: The minimum size the particle can start at.
zh_cn: 粒子开始的最小尺寸。

source: The minimum speed the particle can start at.
zh_cn: 粒子可以开始的最小速度。

source: The minimum starting angle of the particles.
zh_cn: 粒子的最小起始角度。

source: The minimum the final colour's blue component can be.
zh_cn: 最终颜色的蓝色成分的最小值。

source: The minimum the final colour's green component can be.
zh_cn: 最终颜色的绿色成分的最小值。

source: The minimum the final colour's hue component can be.
zh_cn: 最终颜色的色调分量可以达到的最小值。

source: The minimum the final colour's red component can be.
zh_cn: 最终颜色的红色分量的最小值。

source: The minimum the final colour's saturation component can be.
zh_cn: 最终颜色的饱和度分量可以达到的最小值。

source: The minimum the final colour's value component can be.
zh_cn: 最终颜色的亮度分量可以达到的最小值。

source: The minimum value to clamp between.
zh_cn: 夹紧之间的最小值。

source: The minimum vertical space between the edge of the view area and the instance it is set to follow (before the view begins moving and if it is set to follow an instance, default is 0).
zh_cn: 视图区域的边缘和它被设置为跟随的实例之间的最小垂直间距(在视图开始移动之前，如果它被设置为跟随实例，则默认值为0)。

source: The minimum width in pixels for the game window.
zh_cn: 游戏窗口的最小宽度，以像素为单位。

source: The minute to check.
zh_cn: 要检查的时间。

source: The minute to set.
zh_cn: 要设置的分钟。

source: The mip filter mode to use (a constant, default: tf_point).
zh_cn: 要使用的mip过滤器模式(常量，默认值:tf_point)。

source: The mipmap bias value to use (default: 0)
zh_cn: 要使用的mipmap偏置值(默认值:0)

source: The mipmap setting (a constant, default: mip_markedonly)
zh_cn: mipmap设置(一个常量，默认值:mip_markedonly)

source: The mode indicates what can be done with the file:
zh_cn: 该模式指示可以对文件执行的操作:

source: The mode to set (a constant).
zh_cn: 要设置的模式(常量)。

source: The mode value returned by the function will be one of the constants listed below.
zh_cn: 此函数返回的模式值将是下面列出的常量之一。

source: The moment (step) to add to.
zh_cn: 要添加到的时刻(步骤)。

source: The moment to clear.
zh_cn: 清除时刻

source: The month to check.
zh_cn: 要检查的月份。

source: The month to set.
zh_cn: 要设置的月份。

source: The movement between two touches anywhere in the room has been detected as a rotation
zh_cn: 房间中任何地方的两个触摸之间的移动被检测为旋转

source: The movement between two touches anywhere in the room has been detected as inwards
zh_cn: 房间中任何地方的两个触摸之间的移动被检测为向内

source: The movement between two touches anywhere in the room has been detected as outwards
zh_cn: 房间中任何地方的两个触摸之间的移动被检测为向外

source: The movement between two touches anywhere in the room has been detected as rotating
zh_cn: 房间中任何地方的两个触摸之间的移动被检测为旋转

source: The movement between two touches for an instance has been detected as a rotation
zh_cn: 实例的两个触摸之间的移动被检测为旋转

source: The movement between two touches for an instance has been detected as inwards
zh_cn: 实例的两个触摸之间的移动被检测为向内

source: The movement between two touches for an instance has been detected as outwards
zh_cn: 实例的两个触摸之间的移动被检测为向外

source: The movement between two touches for an instance has been detected as rotating
zh_cn: 实例的两次触摸之间的移动被检测为旋转

source: The mp_potential_ functions do their work using a number of parameters that can be changed using this function.
zh_cn: mp_potential_ functions使用许多参数来完成工作，这些参数可以使用此函数来更改。

source: The name "dot product" is derived from the centered dot "·" that is often used to designate this operation (the alternative name "scalar product" emphasizes the scalar rather than vector nature of the result).
zh_cn: "点积"这个名称来源于通常用于指定此操作的居中点"·"(另一个名称"标量积"强调结果的标量性质而不是向量性质)。

source: The name (a string file path) of the file to add.
zh_cn: 要添加的文件的名称(字符串文件路径)。

source: The name (a string) of the animation set to use.
zh_cn: 要使用的动画集的名称(字符串)。

source: The name (a string) of the environment variable to check.
zh_cn: 要检查的环境变量的名称(字符串)。

source: The name (a string) of the first animation set to interpolate from.
zh_cn: 要插值的第一个动画集的名称(字符串)。

source: The name (a string) of the second animation set to interpolate to.
zh_cn: 要插值到的第二个动画集的名称(字符串)。

source: The name (a string) of the skin to use (or a reference returned by the skeleton_skin_create() function).
zh_cn: 要使用的皮肤的名称(字符串)(或由skeleton_skin_create()函数返回的引用)。

source: The name (as a string or a sprite_index) of the attachment image.
zh_cn: 附件图像的名称(字符串或sprite_index形式)。

source: The name (as a string) of the attachment to check.
zh_cn: 要检查的附件的名称(作为字符串)。

source: The name (as a string) of the attachment to create.
zh_cn: 要创建的附件的名称(字符串形式)。

source: The name (as a string) of the attachment to destroy.
zh_cn: 要销毁的附件的名称(字符串形式)。

source: The name (as a string) of the bone.
zh_cn: 骨骼的名称(字符串形式)。

source: The name is whatever has been used to define the path in the editor or (if the path has been created through a code function) it will return a string with the format " _newpathXX" where "XX" is the number of the path generated, starting at 0 and incrementing by one every time a new path is created.
zh_cn: 该名称是编辑器中用来定义路径的任何内容，或者(如果路径是通过代码函数创建的)它将返回一个格式为"_newpathXX"的字符串，其中"XX"是生成的路径的编号，从0开始，每创建一个新路径就递增1。

source: The name of the animation to get the frame from (a string).
zh_cn: 获取帧的动画名称(字符串)。

source: The name of the asset (a string) or its index value (an integer).
zh_cn: 资源的名称(字符串)或其索引值(整数)。

source: The name of the canvas element to link the surface to.
zh_cn: 要将表面链接到的画布元素的名称。

source: The name of the directory to create.
zh_cn: 要创建的目录的名称。

source: The name of the directory to look for.
zh_cn: 要查找的目录的名称。

source: The name of the directory to remove.
zh_cn: 要移除的目录的名称。

source: The name of the dll file (string)
zh_cn: dll文件的名称(字符串)

source: The name of the dll or dylib that you want to free
zh_cn: 要释放的dll或dylib的名称

source: The name of the file to append to.
zh_cn: 要追加到的文件的名称。

source: The name of the file to change.
zh_cn: 要更改的文件的名称。

source: The name of the file to check for.
zh_cn: 要检查的文件的名称。

source: The name of the file to check.
zh_cn: 要检查的文件的名称。

source: The name of the file to copy.
zh_cn: 要复制的文件的名称。

source: The name of the file to delete.
zh_cn: 要删除的文件的名称。

source: The name of the file to load from.
zh_cn: 要从中加载的文件的名称。

source: The name of the file to load the map data from.
zh_cn: 要从中加载映射数据的文件的名称。

source: The name of the file to load.
zh_cn: 要加载的文件的名称。

source: The name of the file to open (as a string)
zh_cn: 要打开的文件名(作为字符串)

source: The name of the file to read from.
zh_cn: 要从中读取的文件的名称。

source: The name of the file to save as.
zh_cn: 要另存为的文件的名称。

source: The name of the file to save the game to.
zh_cn: 保存游戏的文件名。

source: The name of the file to save the map to
zh_cn: 要保存map到的文件的名称

source: The name of the file to write to.
zh_cn: 要写入的文件名。

source: The name of the filter/effect to create (as a string).
zh_cn: 要创建的过滤器/效果的名称(作为字符串)。

source: The name of the font to use.
zh_cn: 要使用的字体的名称。

source: The name of the function (string)
zh_cn: 函数名(字符串)

source: The name of the function that you want to call
zh_cn: 要调用的函数的名称

source: The name of the function/script that you want to call
zh_cn: 要调用的函数/脚本的名称

source: The name of the game asset to get the index of (a string).
zh_cn: 要获取索引的游戏资源的名称(字符串)。

source: The name of the game asset to get the type of (a string).
zh_cn: 要获取类型的游戏资源的名称(字符串)。

source: The name of the global variable to check for (as a string)
zh_cn: 要检查的全局变量的名称(作为字符串)

source: The name of the global variable to get (as a string)
zh_cn: 要获取的全局变量的名称(作为字符串)

source: The name of the global variable to set (as a string)
zh_cn: 要设置的全局变量的名称(作为字符串)

source: The name of the group (as a string).
zh_cn: 组的名称(字符串形式)。

source: The name of the layer (a string or ID value)
zh_cn: 层的名称(字符串或ID值)

source: The name of the layer (a string)
zh_cn: 图层名称(字符串形式)

source: The name of the new, copied, file.
zh_cn: 新复制文件的名称。

source: The name of the option to get the value from (a string, see the table above)
zh_cn: 要从中获取值的选项的名称(字符串，参见上表)

source: The name of the option to set (a string, see the table above)
zh_cn: 要设置的选项的名称(字符串，见上表)

source: The name of the parameter to change the value of (as a string)
zh_cn: 要更改其值的参数的名称(字符串形式)

source: The name of the saved image file.
zh_cn: 保存的图像文件的名称。

source: The name of the script that you want to check.
zh_cn: 要检查的脚本的名称。

source: The name of the skin to create.
zh_cn: 要创建的皮肤的名称。

source: The name of the skin to use (a string).
zh_cn: 要使用的皮肤的名称(字符串)。

source: The name of the skin to use for drawing (a string).
zh_cn: 用于绘图的蒙皮的名称(字符串)。

source: The name of the struct variable to check for (as a string)
zh_cn: 要检查的结构变量的名称(作为字符串)

source: The name of the texture group to check (a string)
zh_cn: 要检查的纹理组的名称(字符串)

source: The name of the texture group to load (a string)
zh_cn: 要加载的纹理组的名称(字符串)

source: The name of the texture group to unload (a string)
zh_cn: 要卸载的纹理组的名称(字符串)

source: The name of the variable to check for (as a string)
zh_cn: 要检查的变量的名称(作为字符串)

source: The name of the variable to get (as a string)
zh_cn: 要获取的变量的名称(作为字符串)

source: The name of the variable to remove (as a string)
zh_cn: 要删除的变量的名称(作为字符串)

source: The name of the variable to set (as a string)
zh_cn: 要设置的变量的名称(作为字符串)

source: The name or ID of the layer to modify
zh_cn: 要修改的图层的名称或ID

source: The name returned is that which you set when you created the sprite in your animation program.
zh_cn: 返回的名称是您在动画程序中创建精灵时设置的名称。

source: The name to give the layer (a string - optional)
zh_cn: 给层指定的名称(字符串-可选)

source: The name/ID of the achievement.
zh_cn: 成就的名称/ID。

source: The name/ID of the leaderboard.
zh_cn: 排行榜的名称/ID。

source: The name/id of the achievement.
zh_cn: 成就的名称/id。

source: The names will be strings and can then be used in the other animation functions for these types of sprite.
zh_cn: 名称将是字符串，然后可以在这些类型的精灵的其他动画函数中使用。

source: The names will be strings and can then be used in the other skeleton animation bone functions for these types of sprite.
zh_cn: 这些名称将是字符串，然后可以在这些类型的精灵的其他骨骼动画骨骼功能中使用。

source: The names will be strings and can then be used in the other skeleton animation skin functions for these types of sprite.
zh_cn: 这些名称将是字符串，然后可以在这些类型的精灵的其他骨骼动画皮肤函数中使用。

source: The names will be strings and can then be used in the other skeleton animation slot functions for these types of sprite.
zh_cn: 这些名称将是字符串，然后可以在这些类型的精灵的其他骨架动画槽函数中使用。

source: The natural logarithm ln(n) is the amount of time needed to reach a certain level of continuous growth, where n is the level reached.
zh_cn: 自然对数ln(n)是达到某一持续增长水平所需的时间量，其中n是达到的水平。

source: The near clipping plane.
zh_cn: 近剪裁平面。

source: The network protocol to use
zh_cn: 要使用的网络协议

source: The new X axis scale value to apply to the sequence element
zh_cn: 应用于序列元素的新X轴缩放值

source: The new Y axis scale value to apply to the sequence element
zh_cn: 应用于序列元素的新的Y轴比例值

source: The new Z depth
zh_cn: 新的Z深度

source: The new angle to rotate the sequence element to
zh_cn: 将序列元素旋转到的新角度
